---
kind: other
id: Methods.T:Autodesk.Revit.UI.Selection.ISelectionFilter
source: html/83ef1fe1-1dd2-92aa-6410-87903e9a0bb0.htm
---
# ISelectionFilter Methods

Override this pre-filter method to specify if the element should be permitted to be selected.